function BlackBody(T, d, R, dl)
% 计算温度T、半径r、观测距离R的物体, 当符合黑体辐射规律时的辐射特性
% 输入参数:
% T : 温度, K
% d : 物体直径, m, 圆形
% R : 观测距离, m
% dl: 相对中心波长的积分范围, um, 即积分区间是: [l0-dl/2, l0+dl/2]
%
% 输出参数:
% 
% 常数项:
h = 6.62607015E-34; % 普朗克常数, J.s
c = 299792458;      % 光速, m.s^-1
k = 1.380649E-23;   % 玻尔兹曼常数, J/K
%

% 函数:
% f1: 辐射率, 自变量: 波长
% f2: 辐射率, 自变量: 频率
%
f1 = @(x) 2 * h * c^-2 * x^-5 * (exp(h * c / x / k / T) - 1)^-1;
f2 = @(x) 2 * h * c^-2 * x^3 * (exp(h * x / k / T) - 1)^-1

%
dl = dl * 0.5E-6; % 波长积分半长, m
l0 = PeakWavelength(T) * 1E-9; % 峰值波长, m
l1 = l0 - dl;
l2 = l0 + dl;   % [l1, l2]: 积分区间
v0 = c / l0;
v1 = c / l2;
v2 = c / l1;    % [v1, v2]: 频率区间
s  = 0.25 * pi * d^2; % 物体等效面积

% 辐照度
EL = f1(l0) * (d / R)^2   % 
EV = f2(v0) * (d / R)^2

% 辐射通量

end
